BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>MPSXB9ZgpqRhhy+AER9aUnSnj4/BejrP+UU+rw1ZKKHaOXCvYoHEaIc47e9anuxo3lyqOk45YWfZ&#13;
YMKNBKiRCCNncXhLOu5eLiYsw3B0n9XcXQGu7l2+oUCnVhf25+4LvDxE+QgkZZG4RBz9bRfNukPW&#13;
lCmYmV8z2vcLDacwfbjXqfaJepQV9D3TMMcOdZRRfy3OQ0czco2C5duMftSiWuRuy2iLxJlCVyB2&#13;
FqXJ5k1Gck9qQIWd1s8g6VChzCf0EVZEzukHUJqjkP0UobJkTC2BuXJYDgpiZFbKJb9NXJJ2DTuM&#13;
Uj1BuACLqn/HDN+T5c2xVnMLA37ix7sSGFicMQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>jXwGc2mJOqO7FWYZeq8PKCXdgTV31B17krCziApjV6EHXDRWFpBesZJgMHQgSx7FoPkWBQb8RQ2S&#13;
mLS9ThGv9buJFrezlmXuWSLFpJponFe1IJmexKN99Zwqw6LXijQnzLBLhjUkSVCjp4PksPMfqzll&#13;
nUAqCK61GEp9TtytuiaELhAjCsAWe2RlArY1D+LMOWZAJlgVO7i7g6mSjojK5/eoj9nsRZ3lGZFp&#13;
bcFgFAyLk+BTdv2g2Lw+yqEomk4QPRKrxn67GdqR+uyF7PyrYpoBmlOSCqBBh97WmHJnXmqphOYG&#13;
Dh8AfLa+gWBWfzs+qsBBrlAiT3cW2GkvlXydQ0Q+r4CyMW2WoEGRbKuZinuLPCTIcax2m8xhIpKn&#13;
35v4sMK6YioomKDIAB6kgT3g13uQdRaeO8Bl5Cg6hOo5DxRi90BwUMiCf9Z1OiH3HsCWYIB3xnwH&#13;
TTbk6BbYTxmUikYDyr0NTAwEIgtQgw+VkAf1+i/M5QGVq6w/ZwU3IdJk28Gt7QBRRindXLP4XWmh&#13;
wk8THtRyv2cSysBT72vlfQ08BbDd7UypGKfsIAk+GDvznKSOzwRydTomxWxjpHMRsmdrwGVtAToS&#13;
vFuneQMt+7S0IhiBkJW3rRvty2jcmeoObi97wLZvEB6HXFFGxQrw58iEOZiEcjMDZMt2rt17LcRF&#13;
IOpCRcKJkV0dL3PYI+KUbAQwUUy3gJmLlWLP3djFOjNFlVsiE3MdBg08Rz/LHYSlIaUZuR+Rmanm&#13;
CjMpbdDnoqlgWvXKxow5Zt6ETb+o0+mRIojrxZQHqP//hqzaTCmlaMoUROAwQPjplbl0NCa9C0Hl&#13;
O8dfYpNtViIum6MZcBdG5UgprmF/zan4KU3xlOZMSmQ4n3N6z6M2Lkhf6Ula2LHQ5aCI/d9f6UJG&#13;
OnUtoAlA5lTNZOekIPiPim0jaeoWpQ0iF1X7YajvMmWUtJuq+GcpZEQiuiDRhZuTzEPABGU6Dydl&#13;
sezofHdEH0knQhN4Tq/r1qZ64WKXgvvQhotjQpIYGS/8qYHqPKwygrmT4xvxMEeYdSe3fUjmc535&#13;
ggDXS1DkRzO4svXE0F9Z+PTIxjnIIN0XDHaqg9ene7qMrieWktKrvXqbjkC1kPVt8Ezxibb/I1bb&#13;
lM0Le78FEzV6YGki93OyqPp870U6OzZgOwvThMJLLiZ+0fKSyQdcLE4CflHfX6aVao0rA1+/bmnw&#13;
dkaDaAHLsLH9RL+MbTYGlzjUx5kg6bADkrPrHi/VRDL3fP464LBDBGcy/QDyf+KON0b9/jAdMIn9&#13;
b2tUAcg9fzW7bC+PnhcdTHsIBpDX1qjSw+hE1RtldArgS2fJrZdqKlajQzE9hnUu4FZD4LTpnQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>pT9sFjwVye9wQCWAyi+fjPb4cXw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
ZeS06MK5JJnqUICudFEpDdBsDB1Ffb8eWJpZbYLI0ppZATyaLmQXFBVlHbAvh1DK80dF2n4JU3xF&#13;
YqbIqc15jqcKXsVoB/bPiJdKfiH8zDV4q/nLdC+tfXWzwEfMI8Ol4wpbF15ana8jZe0tOtaA2NpW&#13;
4hOWjCcb9L28WGITS8UHvg5iioMEt5/S5v7k3ARM83XTXyMCiSowpL7UesX8jfpX8HmwnJfPfQm2&#13;
BVzpdMRqEEANWoyw3ZoPoWxe+XDIgz1IaVA74bljwZJhoCD7Bs3xicpc8ogRvTSjI92tiKfwiUY8&#13;
QRwFOQvwbU4UeiatSIuPDfTsx0FARs4xuo22bA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>